portfolio_data = {
    "about_me": """Всем привет, меня зовут Нуртас. Мне 14 лет, и сейчас я активно расту в сфере IT: участвую в хакатонах и стартап-проектах, а также волонтёрю в American Corner.""",
    "goal": "Я пришёл в программирование, потому что мне это искренне интересно — я люблю создавать что-то новое и запускать стартапы. Но моя главная цель — поступить в один из университетов Лиги плюща.",
    "path_in_it": """В IT-сферу я пришёл после одной важной истории, которая изменила меня с ног до головы.
Прошлым летом я решил поступать в специализированный лицей. Конкуренция была очень высокой: сильные ученики, сложный формат экзамена — а я сам был не до конца готов. Но я понимал: если действительно чего-то хочешь, нужно хотя бы попытаться. Поэтому готовился днями и ночами.
Настал день экзамена. Я сдал его и с волнением ждал результатов. Когда пришёл ответ, я увидел, что мне не хватило всего одного балла. Именно одного.
В тот момент школа позвонила нам и сказала, что у меня ещё есть шанс — если есть внеклассные достижения. Но я застыл, потому что у меня их не было совсем. Меня не приняли.
Тогда я дал себе обещание: создать сильное портфолио и стать лучше, чем был вчера.
И тут в нашу школу пришли представители CAP EDUCATION — рассказать про форум, который у нас будет. Я очень заинтересовался этой сферой и сразу рассказал родителям, и мы с папой пошли на этот форум. Там всё подробно объяснили, и я понял, что это моё — попросил родителей купить мне курс. И мой путь официально начался.
С самого начала было тяжело и непонятно, но потом я начал погружаться в эту сферу полностью: искал места, где собираются программисты и стартаперы, и постепенно начал осваиваться. Мне реально понравилось работать, и я начал понимать, что для меня это шанс выполнить своё обещание по истории можно еще ознокомится https://www.instagram.com/p/DYcbpLlkqA-/?igsh=MXRvbzd4YjM5bTRlaA==""",
    "mentor": """Мой ментор — куратор Кундыз. Она всегда помогает и поддерживает меня в трудные минуты, когда что-то не получается — я всегда знаю, что могу обратиться к ней. Была даже история, когда я столкнулся с выгоранием: именно она помогла мне из него выбраться, была рядом в любое время суток и поддерживала меня. Для меня она уже стала очень близким человеком, к которому я могу обратиться, даже когда уже выпустился.""",
    "point_a_b": """Если говорить о начальной точке, то в самом начале я не умел абсолютно ничего и даже не умел пользоваться компьютером. А в итоге на данный момент я разрабатываю стартапы, научные проекты, программы, которые значительно облегчают людям жизнь. И самое главное — я всё ещё иду к своему обещанию: «создать сильное портфолио и стать лучше, чем был вчера». В этом мне помогает база, которую дал CAP EDUCATION — лучшая школа программирования""",
    "hobbies": """Если говорить о хобби и интересах, то в свободное время я занимаюсь волонтёрством в American Corner, продвигаю свой инженерный клуб, играю в шахматы (у меня 2 разряд) и очень люблю бегать. А ещё недавно начал заниматься в тренажёрном зале.""",
    "best_works": """Проектная работа №4 — блог на Django

В этой проектной работе я завершил своё обучение в Cap Education и реализовал проект, в котором пользователь мог регистрироваться и авторизовываться — я даже написал свой backend, и для меня это было «вау». Также пользователь мог выкладывать свои статьи, а другие пользователи могли их лайкать.
 У него был свой профиль, в котором можно было выкладывать свои проекты.
 
Проектная работа №3 — Telegram-бот-напоминалка

В этой проектной работе я создал Telegram-бота, который напоминает выпить воды к дедлайну, который пользователь указывает сам.""",
    "best_works_photos": "pr4.jpg,pr4g.jpg,pr4h.jpg,tg2.jpg",
    "github_link": "github.com/nurtas-07"
}


achievements = [
    """Являюсь фаундером(билдером, питчером, дизайнером, нетворкером) проекта SGB-PRODUCTION. 
    Я разрабатывал корпусы коды логики работы подключения микро датчиков, договаривался о встречах с потенциальными покупателями для получение обратной связи. 
    Который имеет награды такие как 1 место в республиканском соревнования научных проектов ҰОАҚ в сфере роботехники, также 1 место в облостном этапе научных проектов ҰОАҚ в сфере роботехники, 1 место в облостном этапе Табиғаты Аяла форум сфера Жасыл идея, 3 место в облостном этапе Экологиялық білім беруді тұрақты дамуты бойынша үздік балалар бизнес жобасы.
    Капитан Команды lecaganus которая заняла 1 место в хакатоне Just Build It.
    Участвовал в летнем хакатон Инженеров в сфере mechanical engineering занял 1 место
    Стал Резидентом Makerspace получил финансирование на проведение хакатона FutureTech 100.000 KZT. Хакатон FuterTech обьединил 76 участников и показал большой и уверенный масштаб работы хакатона Instagram futertech_hackathon
    Капитан Команды KazTech которая получила 2 место в 'KazRobotics-2025'.
    Волонтёр в American Corner in Oral. Веду свой клуб Engineering Lab который обьединил 15 человек за одну неделю. Я обучаю инженерии по этапам сначало начинаем с лего потом переходим к ардуино и после этого строим 3d модель в Fusion 360.instagram enginerinnlab_oral""",
   
]

hackathons = [
    {
        "name": "FuterTech Hackathon",
        "description": " В свои 14 лет стал  резидентом Makerspace получил финансирование 100 000 ₸ на проведение хакатона. FutureTech объединил 76 участников и показал серьёзный масштаб работы.instagram futertech_hackathon=https://www.instagram.com/futuretech_hackathon?igsh=MXZtN2JremZhNjJ5ZQ==",
        "photo": "future_tech/fh.jpg,future_tech/fh6.jpg,future_tech/fh14.jpg"
    },
    {
        "name": "KazRobotics-2025",
        "description": "Стал капитаном команды KazTech в конкурсе KazRobotics которая в ходе трехнедельной работы получила 2 место в республиканском конкурсе ",
        "photo": "kaz.jpg,kazrobo.jpg"
    }
    ,{
        "name": "Just Build It",
        "description": "Собрал команду Le Caganus которая в ходе 3 дней работы над проектом получила 1 место в хакатоне Just Build It",
        "photo": "just_build_it/jvb.jpg"
    },
      {
        "name": "Engineering Hackathon 2025",
        "description": "Хакатон в сфере mechanical engineering который начал мой путь в инженерии и робототехнике, в ходе которого я получил 1 место",
        "photo": "hacken (1).jpg,hacken (2).jpg,hacken (3).jpg"
    },
      {
        "name": "Engineering Lab (свой клуб)",
        "description": "Веду свой инженерный клуб, который объединил 15 человек за первую неделю. Обучаю инженерии по этапам: сначала Lego, потом Arduino, в конце — 3D-модель в Fusion 360.instagram engineerinlab_oral-https://www.instagram.com/engineerinlab_oral?igsh=MXZjY3l0czNldnA4eA==",
        "photo": "enginerr(1).jpg,enginerr(2).jpg,enginerr(3).jpg"
    },
         {
        "name": "American Corner",
        "description": "Волонтёрская работа в American Corner: помогал организовывать мероприятия, поддерживал гостей и развивал сообщество,выступал перед посольством США и рассказывал о своем клубе",
        "photo": "AC/250AC.jpg,AC/250AC2.jpg,AC/250AC3.jpg"
    },
     {
        "name": "Inspire Fest",
        "description": " Участвовал в Inspire Fest где встретились многие инженеры в сфере mechanical engineering и робототехники, где я смог познакомиться с многими инженерами и обсудить свои идеи и занять первое место и выиграть 3д Принтер",
        "photo": "Inspire fest/inspirefest2.jpg,Inspire fest/inspire2025.jpg"
    },
     {
        "name": "Startup",
        "description": """Создавал стартапы в сферах ed tech, finance tech и bio tech:
- TAN: Финансовый автопилот который помогает выйти из долговой ямы https://bailout-buddy-app.nurbakyt-nur.workers.dev/
- Teacher Guard: AI-ассистент, который снижает стресс учителей при общении с родителями
- SGB Production: Интеллектуальная экосистема для автоматизированного выращивания растений и переработки органики на базе предиктивного ИИ sgb-nu.vercel.app""",
        "photo": "STARTUP/TAN.jpg,STARTUP/teacherguard (1).jpg,STARTUP/teacherguard (2).jpg,STARTUP/teacherguard (3).jpg,STARTUP/sgb (1).jpg,STARTUP/sgb (2).jpg"
    }
]

ai_context_parts = [
    f"Обо мне: {portfolio_data['about_me']}",
    f"Моя цель: {portfolio_data['goal']}",
    f"Путь в IT: {portfolio_data['path_in_it']}",
    f"Мой ментор: {portfolio_data['mentor']}",
    f"Точка А -> Точка Б: {portfolio_data['point_a_b']}",
    f"Мои хобби: {portfolio_data['hobbies']}",
    f"Лучшие работы: {portfolio_data['best_works']}",
    f"GitHub: {portfolio_data['github_link']}"
]

ai_context_string = "\n".join(ai_context_parts)
